stm32-hotspot/STM32U3-M2-Serial-Mem-EMS-Test-Code/Naquada/Baseline/STM32U3LQFP100_SMPS.c
/* Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 */

// STM32U3LQFP100_SMPS

#include "main.h"
#include "STM32U3LQFP100_SMPS.h"
#include "adc_channels.h" // rename the channels with their numbers, simple!
const DS_PAD_t DS_PADs[] = { // Not DS_PAT_t !!! fix the script
{ PE_2, (uint32_t) TSC, TSC_G7_IO1, 9 }, 
{ PE_2, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_2, (uint32_t) SAI1, SAI1_CK1, 3 }, 
{ PE_2, (uint32_t) 0, TRACECLK, 0 }, 
{ PE_2, (uint32_t) SAI1, SAI1_MCLK_A, 13 }, 
{ PE_2, (uint32_t) TIM3, TIM3_ETR, 2 }, 
{ PE_3, (uint32_t) TIM3, TIM3_CH1, 2 }, 
{ PE_3, (uint32_t) SAI1, SAI1_SD_B, 13 }, 
{ PE_3, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_3, (uint32_t) 0, TRACED0, 0 }, 
{ PE_3, (uint32_t) OCTOSPI1, OCTOSPI1_DQS, 3 }, 
{ PE_3, (uint32_t) TSC, TSC_G7_IO2, 9 }, 
{ PE_4, (uint32_t) TIM3, TIM3_CH2, 2 }, 
{ PE_4, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_4, (uint32_t) TSC, TSC_G7_IO3, 9 }, 
{ PE_4, (uint32_t) 0, TRACED1, 0 }, 
{ PE_4, (uint32_t) 0, WKUP1, -1 }, 
{ PE_4, (uint32_t) SAI1, SAI1_FS_A, 13 }, 
{ PE_4, (uint32_t) SAI1, SAI1_D2, 3 }, 
{ PE_5, (uint32_t) TSC, TSC_G7_IO4, 9 }, 
{ PE_5, (uint32_t) 0, TRACED2, 0 }, 
{ PE_5, (uint32_t) 0, WKUP2, -1 }, 
{ PE_5, (uint32_t) TIM3, TIM3_CH3, 2 }, 
{ PE_5, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_5, (uint32_t) SAI1, SAI1_CK2, 3 }, 
{ PE_5, (uint32_t) SAI1, SAI1_SCK_A, 13 }, 
{ PE_6, (uint32_t) 0, WKUP3, -1 }, 
{ PE_6, (uint32_t) SAI1, SAI1_D1, 3 }, 
{ PE_6, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_6, (uint32_t) SAI1, SAI1_SD_A, 13 }, 
{ PE_6, (uint32_t) TAMP, TAMP_IN3, -1 }, 
{ PE_6, (uint32_t) 0, TRACED3, 0 }, 
{ PE_6, (uint32_t) TIM3, TIM3_CH4, 2 }, 
{ PC_13, (uint32_t) RTC, RTC_TS, -1 }, 
{ PC_13, (uint32_t) 0, WKUP2, -1 }, 
{ PC_13, (uint32_t) TAMP, TAMP_IN1, -1 }, 
{ PC_13, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_13, (uint32_t) RTC, RTC_OUT1, -1 }, 
{ PC_14, (uint32_t) 0, EVENTOUT, 15 }, 
//{ PC_14, (uint32_t) OSC32, OSC32_IN, -1 }, 
//{ PC_15, (uint32_t) OSC32, OSC32_OUT, -1 }, 
{ PC_15, (uint32_t) 0, EVENTOUT, 15 }, 
{ PH_0, (uint32_t) 0, EVENTOUT, 15 }, 
//{ PH_0, (uint32_t) OSC, OSC_IN, -1 }, 
{ PH_1, (uint32_t) 0, EVENTOUT, 15 }, 
//{ PH_1, (uint32_t) OSC, OSC_OUT, -1 }, 
{ PC_0, (uint32_t) ADC1, ADC1_IN1, ADC_CHANNEL_1}, 
{ PC_0, (uint32_t) SDMMC1, SDMMC1_D5, 12 }, 
{ PC_0, (uint32_t) I2C3, I2C3_SCL, 4 }, 
{ PC_0, (uint32_t) OCTOSPI1, OCTOSPI1_IO7, 3 }, 
{ PC_0, (uint32_t) LPTIM2, LPTIM2_IN1, 14 }, 
{ PC_0, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_0, (uint32_t) I3C2, I3C2_SCL, 6 }, 
{ PC_0, (uint32_t) LPUART1, LPUART1_RX, 8 }, 
{ PC_0, (uint32_t) SPI2, SPI2_RDY, 5 }, 
{ PC_0, (uint32_t) LPTIM1, LPTIM1_IN1, 1 }, 
{ PC_1, (uint32_t) ADC1, ADC1_IN2, ADC_CHANNEL_2}, 
{ PC_1, (uint32_t) SPI2, SPI2_MOSI, 3 }, 
{ PC_1, (uint32_t) I3C2, I3C2_SDA, 6 }, 
{ PC_1, (uint32_t) OCTOSPI1, OCTOSPI1_IO4, 10 }, 
{ PC_1, (uint32_t) LPTIM1, LPTIM1_CH1, 1 }, 
{ PC_1, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_1, (uint32_t) SAI1, SAI1_SD_A, 13 }, 
{ PC_1, (uint32_t) 0, TRACED0, 0 }, 
{ PC_1, (uint32_t) I3C1, I3C1_SDA, 5 }, 
{ PC_1, (uint32_t) I2C3, I2C3_SDA, 4 }, 
{ PC_1, (uint32_t) LPUART1, LPUART1_TX, 8 }, 
{ PC_2, (uint32_t) SPI2, SPI2_MISO, 5 }, 
{ PC_2, (uint32_t) ADC2, ADC2_IN1, ADC_CHANNEL_1}, 
{ PC_2, (uint32_t) LPTIM1, LPTIM1_IN2, 1 }, 
{ PC_2, (uint32_t) OCTOSPI1, OCTOSPI1_IO5, 10 }, 
{ PC_2, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_3, (uint32_t) ADC2, ADC2_IN2, ADC_CHANNEL_2}, 
{ PC_3, (uint32_t) SPI2, SPI2_MOSI, 5 }, 
{ PC_3, (uint32_t) LPTIM2, LPTIM2_ETR, 14 }, 
{ PC_3, (uint32_t) SAI1, SAI1_D1, 3 }, 
{ PC_3, (uint32_t) OCTOSPI1, OCTOSPI1_IO6, 10 }, 
{ PC_3, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_3, (uint32_t) LPTIM1, LPTIM1_ETR, 1 }, 
{ PC_3, (uint32_t) SAI1, SAI1_SD_A, 13 }, 
{ PC_3, (uint32_t) LPTIM3, LPTIM3_CH1, 2 }, 
{ PA_0, (uint32_t) TIM2, TIM2_CH1, 1 }, 
{ PA_0, (uint32_t) TIM2, TIM2_ETR, 14 }, 
{ PA_0, (uint32_t) OPAMP1, OPAMP1_VINP, -1 }, 
{ PA_0, (uint32_t) 0, AUDIOCLK, 13 }, 
{ PA_0, (uint32_t) ADC1, ADC1_IN3, ADC_CHANNEL_3}, 
{ PA_0, (uint32_t) TAMP, TAMP_IN2, -1 }, 
{ PA_0, (uint32_t) UART4, UART4_TX, 8 }, 
{ PA_0, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_0, (uint32_t) SPI3, SPI3_RDY, 6 }, 
{ PA_0, (uint32_t) 0, WKUP1, -1 }, 
{ PA_1, (uint32_t) I2C1, I2C1_SMBA, 4 }, 
{ PA_1, (uint32_t) TIM15, TIM15_CH1N, 14 }, 
{ PA_1, (uint32_t) OPAMP1, OPAMP1_VINM, -1 }, 
{ PA_1, (uint32_t) TAMP, TAMP_IN5, -1 }, 
{ PA_1, (uint32_t) OCTOSPI1, OCTOSPI1_DQS, 10 }, 
{ PA_1, (uint32_t) ADC1, ADC1_IN4, ADC_CHANNEL_4}, 
{ PA_1, (uint32_t) I2C2, I2C2_SMBA, 3 }, 
{ PA_1, (uint32_t) 0, WKUP3, -1 }, 
{ PA_1, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_1, (uint32_t) I3C1, I3C1_SDA, 6 }, 
{ PA_1, (uint32_t) LPTIM1, LPTIM1_CH2, 0 }, 
{ PA_1, (uint32_t) UART4, UART4_RX, 8 }, 
{ PA_1, (uint32_t) SPI1, SPI1_SCK, 5 }, 
{ PA_1, (uint32_t) TIM2, TIM2_CH2, 1 }, 
{ PA_2, (uint32_t) TIM15, TIM15_CH1, 14 }, 
{ PA_2, (uint32_t) OCTOSPI1, OCTOSPI1_NCS, 10 }, 
{ PA_2, (uint32_t) ADC1, ADC1_IN5, ADC_CHANNEL_5}, 
{ PA_2, (uint32_t) 0, LSCO, -1 }, 
{ PA_2, (uint32_t) 0, WKUP4, -1 }, 
{ PA_2, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_2, (uint32_t) COMP1, COMP1_INP3, -1 }, 
{ PA_2, (uint32_t) TIM2, TIM2_CH3, 1 }, 
{ PA_2, (uint32_t) SPI1, SPI1_RDY, 5 }, 
{ PA_2, (uint32_t) LPUART1, LPUART1_TX, 8 }, 
{ PA_3, (uint32_t) COMP1, COMP1_INP4, -1 }, 
{ PA_3, (uint32_t) 0, WKUP5, -1 }, 
{ PA_3, (uint32_t) OPAMP1, OPAMP1_VOUT, -1 }, 
{ PA_3, (uint32_t) OCTOSPI1, OCTOSPI1_CLK, 10 }, 
{ PA_3, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_3, (uint32_t) SAI1, SAI1_CK1, 3 }, 
{ PA_3, (uint32_t) ADC1, ADC1_IN6, ADC_CHANNEL_6}, 
{ PA_3, (uint32_t) LPUART1, LPUART1_RX, 8 }, 
{ PA_3, (uint32_t) TIM15, TIM15_CH2, 14 }, 
{ PA_3, (uint32_t) TIM2, TIM2_CH4, 1 }, 
{ PA_3, (uint32_t) SAI1, SAI1_MCLK_A, 13 }, 
{ PA_4, (uint32_t) DAC1, DAC1_OUT1, -1 }, 
{ PA_4, (uint32_t) OCTOSPI1, OCTOSPI1_NCS, 3 }, 
{ PA_4, (uint32_t) ADC1, ADC1_IN7, ADC_CHANNEL_7}, 
{ PA_4, (uint32_t) LPTIM2, LPTIM2_CH1, 14 }, 
{ PA_4, (uint32_t) SAI1, SAI1_FS_B, 13 }, 
{ PA_4, (uint32_t) SPI1, SPI1_NSS, 5 }, 
{ PA_4, (uint32_t) 0, WKUP2, -1 }, 
{ PA_4, (uint32_t) SPI3, SPI3_NSS, 6 }, 
{ PA_4, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_4, (uint32_t) ADC2, ADC2_IN3, ADC_CHANNEL_3}, 
{ PA_5, (uint32_t) TIM2, TIM2_CH1, 1 }, 
{ PA_5, (uint32_t) TIM2, TIM2_ETR, 2 }, 
{ PA_5, (uint32_t) ADC1, ADC1_IN8, ADC_CHANNEL_8}, 
{ PA_5, (uint32_t) 0, WKUP6, -1 }, 
{ PA_5, (uint32_t) USART3, USART3_RX, 7 }, 
{ PA_5, (uint32_t) PWR, PWR_CSLEEP, 0 }, 
{ PA_5, (uint32_t) DAC1, DAC1_OUT2, -1 }, 
{ PA_5, (uint32_t) LPTIM2, LPTIM2_ETR, 14 }, 
{ PA_5, (uint32_t) ADC2, ADC2_IN4, ADC_CHANNEL_4}, 
{ PA_5, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_5, (uint32_t) SPI1, SPI1_SCK, 5 }, 
{ PA_6, (uint32_t) TIM16, TIM16_CH1, 14 }, 
{ PA_6, (uint32_t) I2C2, I2C2_SDA, 4 }, 
{ PA_6, (uint32_t) OPAMP2, OPAMP2_VINP, -1 }, 
{ PA_6, (uint32_t) I3C2, I3C2_SDA, 3 }, 
{ PA_6, (uint32_t) TIM3, TIM3_CH1, 2 }, 
{ PA_6, (uint32_t) USART3, USART3_CTS, 7 }, 
{ PA_6, (uint32_t) 0, WKUP7, -1 }, 
{ PA_6, (uint32_t) TIM1, TIM1_BKIN, 1 }, 
{ PA_6, (uint32_t) SPI1, SPI1_MISO, 5 }, 
{ PA_6, (uint32_t) LPUART1, LPUART1_CTS, 8 }, 
{ PA_6, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_6, (uint32_t) ADC2, ADC2_IN5, ADC_CHANNEL_5}, 
{ PA_6, (uint32_t) OCTOSPI1, OCTOSPI1_IO3, 10 }, 
{ PA_6, (uint32_t) I3C1, I3C1_SDA, 6 }, 
{ PA_6, (uint32_t) ADC1, ADC1_IN9, ADC_CHANNEL_9}, 
{ PA_6, (uint32_t) USART3, USART3_NSS, 7 }, 
{ PA_7, (uint32_t) I2C3, I2C3_SCL, 4 }, 
{ PA_7, (uint32_t) I3C1, I3C1_SCL, 6 }, 
{ PA_7, (uint32_t) 0, WKUP8, -1 }, 
{ PA_7, (uint32_t) TIM3, TIM3_CH2, 2 }, 
{ PA_7, (uint32_t) TIM17, TIM17_CH1, 14 }, 
{ PA_7, (uint32_t) OCTOSPI1, OCTOSPI1_IO2, 10 }, 
{ PA_7, (uint32_t) ADC2, ADC2_IN6, ADC_CHANNEL_6}, 
{ PA_7, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_7, (uint32_t) SPI1, SPI1_MOSI, 5 }, 
{ PA_7, (uint32_t) PWR, PWR_CSTOP, 0 }, 
{ PA_7, (uint32_t) LPTIM2, LPTIM2_CH2, 13 }, 
{ PA_7, (uint32_t) USART3, USART3_TX, 7 }, 
{ PA_7, (uint32_t) ADC1, ADC1_IN10, ADC_CHANNEL_10}, 
{ PA_7, (uint32_t) OPAMP2, OPAMP2_VINM, -1 }, 
{ PA_7, (uint32_t) TIM1, TIM1_CH1N, 1 }, 
{ PB_0, (uint32_t) OCTOSPI1, OCTOSPI1_IO1, 10 }, 
{ PB_0, (uint32_t) OPAMP2, OPAMP2_VOUT, -1 }, 
{ PB_0, (uint32_t) TIM1, TIM1_CH2N, 1 }, 
{ PB_0, (uint32_t) COMP1, COMP1_OUT, 12 }, 
{ PB_0, (uint32_t) 0, AUDIOCLK, 13 }, 
{ PB_0, (uint32_t) ADC2, ADC2_IN9, ADC_CHANNEL_9}, 
{ PB_0, (uint32_t) SPI1, SPI1_NSS, 5 }, 
{ PB_0, (uint32_t) TIM3, TIM3_CH3, 2 }, 
{ PB_0, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_0, (uint32_t) USART3, USART3_CK, 7 }, 
{ PB_0, (uint32_t) LPTIM3, LPTIM3_CH1, 4 }, 
{ PB_0, (uint32_t) ADC1, ADC1_IN13, ADC_CHANNEL_13}, 
{ PB_1, (uint32_t) LPUART1, LPUART1_DE, 8 }, 
{ PB_1, (uint32_t) COMP1, COMP1_INM1, -1 }, 
{ PB_1, (uint32_t) LPTIM2, LPTIM2_IN1, 14 }, 
{ PB_1, (uint32_t) LPUART1, LPUART1_RTS, 8 }, 
{ PB_1, (uint32_t) ADC1, ADC1_IN14, ADC_CHANNEL_14}, 
{ PB_1, (uint32_t) USART3, USART3_RTS, 7 }, 
{ PB_1, (uint32_t) LPTIM3, LPTIM3_CH2, 4 }, 
{ PB_1, (uint32_t) USART3, USART3_DE, 7 }, 
{ PB_1, (uint32_t) TIM1, TIM1_CH3N, 1 }, 
{ PB_1, (uint32_t) OCTOSPI1, OCTOSPI1_IO0, 10 }, 
{ PB_1, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_1, (uint32_t) ADC2, ADC2_IN10, ADC_CHANNEL_10}, 
{ PB_1, (uint32_t) TIM3, TIM3_CH4, 2 }, 
{ PB_1, (uint32_t) 0, WKUP4, -1 }, 
{ PB_2, (uint32_t) I3C1, I3C1_SCL, 6 }, 
{ PB_2, (uint32_t) I2C2, I2C2_SCL, 3 }, 
{ PB_2, (uint32_t) RTC, RTC_OUT2, -1 }, 
{ PB_2, (uint32_t) COMP1, COMP1_INP2, -1 }, 
{ PB_2, (uint32_t) I2C3, I2C3_SMBA, 4 }, 
{ PB_2, (uint32_t) LPTIM1, LPTIM1_CH1, 1 }, 
{ PB_2, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_2, (uint32_t) ADC1, ADC1_IN15, ADC_CHANNEL_15}, 
{ PB_2, (uint32_t) OCTOSPI1, OCTOSPI1_DQS, 10 }, 
{ PB_2, (uint32_t) 0, WKUP1, -1 }, 
{ PB_2, (uint32_t) SPI1, SPI1_RDY, 5 }, 
{ PE_7, (uint32_t) TIM1, TIM1_ETR, 1 }, 
{ PE_7, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_7, (uint32_t) SAI1, SAI1_SD_B, 13 }, 
{ PE_7, (uint32_t) 0, WKUP6, -1 }, 
{ PE_8, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_8, (uint32_t) SAI1, SAI1_SCK_B, 13 }, 
{ PE_8, (uint32_t) 0, WKUP7, -1 }, 
{ PE_8, (uint32_t) TIM1, TIM1_CH1N, 1 }, 
{ PE_9, (uint32_t) SAI1, SAI1_FS_B, 13 }, 
{ PE_9, (uint32_t) TIM1, TIM1_CH1, 1 }, 
{ PE_9, (uint32_t) OCTOSPI1, OCTOSPI1_NCLK, 10 }, 
{ PE_9, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_9, (uint32_t) ADF1, ADF1_CCK0, 3 }, 
{ PE_10, (uint32_t) TIM1, TIM1_CH2N, 1 }, 
{ PE_10, (uint32_t) OCTOSPI1, OCTOSPI1_CLK, 10 }, 
{ PE_10, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_10, (uint32_t) SAI1, SAI1_MCLK_B, 13 }, 
{ PE_10, (uint32_t) TSC, TSC_G5_IO1, 9 }, 
{ PE_10, (uint32_t) ADF1, ADF1_SDI0, 3 }, 
{ PE_11, (uint32_t) OCTOSPI1, OCTOSPI1_NCS, 10 }, 
{ PE_11, (uint32_t) TIM1, TIM1_CH2, 1 }, 
{ PE_11, (uint32_t) TSC, TSC_G5_IO2, 9 }, 
{ PE_11, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_11, (uint32_t) SPI1, SPI1_RDY, 5 }, 
{ PE_12, (uint32_t) TSC, TSC_G5_IO3, 9 }, 
{ PE_12, (uint32_t) SPI1, SPI1_NSS, 5 }, 
{ PE_12, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_12, (uint32_t) TIM1, TIM1_CH3N, 1 }, 
{ PE_12, (uint32_t) OCTOSPI1, OCTOSPI1_IO0, 10 }, 
{ PE_13, (uint32_t) OCTOSPI1, OCTOSPI1_IO1, 10 }, 
{ PE_13, (uint32_t) TSC, TSC_G5_IO4, 9 }, 
{ PE_13, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_13, (uint32_t) TIM1, TIM1_CH3, 1 }, 
{ PE_13, (uint32_t) SPI1, SPI1_SCK, 5 }, 
{ PE_14, (uint32_t) TIM1, TIM1_CH4, 1 }, 
{ PE_14, (uint32_t) OCTOSPI1, OCTOSPI1_IO2, 10 }, 
{ PE_14, (uint32_t) SPI1, SPI1_MISO, 5 }, 
{ PE_14, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_14, (uint32_t) TIM1, TIM1_BKIN2, 2 }, 
{ PE_15, (uint32_t) TIM1, TIM1_BKIN, 1 }, 
{ PE_15, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_15, (uint32_t) SPI1, SPI1_MOSI, 5 }, 
{ PE_15, (uint32_t) OCTOSPI1, OCTOSPI1_IO3, 10 }, 
{ PE_15, (uint32_t) TIM1, TIM1_CH4N, 3 }, 
{ PB_10, (uint32_t) TSC, TSC_SYNC, 9 }, 
{ PB_10, (uint32_t) I3C1, I3C1_SCL, 6 }, 
{ PB_10, (uint32_t) 0, WKUP8, -1 }, 
{ PB_10, (uint32_t) SPI2, SPI2_SCK, 5 }, 
{ PB_10, (uint32_t) COMP1, COMP1_OUT, 12 }, 
{ PB_10, (uint32_t) OCTOSPI1, OCTOSPI1_CLK, 10 }, 
{ PB_10, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_10, (uint32_t) I3C2, I3C2_SCL, 3 }, 
{ PB_10, (uint32_t) LPUART1, LPUART1_RX, 8 }, 
{ PB_10, (uint32_t) USART3, USART3_TX, 7 }, 
{ PB_10, (uint32_t) SAI1, SAI1_SCK_A, 13 }, 
{ PB_10, (uint32_t) LPTIM3, LPTIM3_CH1, 2 }, 
{ PB_10, (uint32_t) TIM2, TIM2_CH3, 1 }, 
{ PB_10, (uint32_t) I2C2, I2C2_SCL, 4 }, 
{ PB_11, (uint32_t) I2C2, I2C2_SDA, 4 }, 
{ PB_11, (uint32_t) OCTOSPI1, OCTOSPI1_NCS, 10 }, 
{ PB_11, (uint32_t) USART3, USART3_RX, 7 }, 
{ PB_11, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_11, (uint32_t) COMP2, COMP2_OUT, 12 }, 
{ PB_11, (uint32_t) TIM2, TIM2_CH4, 1 }, 
{ PB_11, (uint32_t) SPI2, SPI2_RDY, 5 }, 
{ PB_11, (uint32_t) LPUART1, LPUART1_TX, 8 }, 
{ PB_13, (uint32_t) TIM15, TIM15_CH1N, 14 }, 
{ PB_13, (uint32_t) I3C1, I3C1_SCL, 3 }, 
{ PB_13, (uint32_t) SPI2, SPI2_SCK, 5 }, 
{ PB_13, (uint32_t) USART3, USART3_CTS, 7 }, 
{ PB_13, (uint32_t) LPUART1, LPUART1_CTS, 8 }, 
{ PB_13, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_13, (uint32_t) I3C2, I3C2_SCL, 6 }, 
{ PB_13, (uint32_t) LPTIM3, LPTIM3_IN1, 2 }, 
{ PB_13, (uint32_t) TSC, TSC_G1_IO2, 9 }, 
{ PB_13, (uint32_t) I2C2, I2C2_SCL, 4 }, 
{ PB_13, (uint32_t) TIM1, TIM1_CH1N, 1 }, 
{ PB_13, (uint32_t) USART3, USART3_NSS, 7 }, 
{ PB_14, (uint32_t) SPI2, SPI2_MISO, 5 }, 
{ PB_14, (uint32_t) TSC, TSC_G1_IO3, 9 }, 
{ PB_14, (uint32_t) I2C2, I2C2_SDA, 4 }, 
{ PB_14, (uint32_t) TIM15, TIM15_CH1, 14 }, 
{ PB_14, (uint32_t) I3C2, I3C2_SDA, 6 }, 
{ PB_14, (uint32_t) TIM1, TIM1_CH2N, 1 }, 
{ PB_14, (uint32_t) USART3, USART3_RTS, 7 }, 
{ PB_14, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_14, (uint32_t) USART3, USART3_DE, 7 }, 
{ PB_14, (uint32_t) LPTIM3, LPTIM3_ETR, 2 }, 
{ PB_15, (uint32_t) SPI2, SPI2_MOSI, 5 }, 
{ PB_15, (uint32_t) RTC, RTC_REFIN, 0 }, 
{ PB_15, (uint32_t) 0, WKUP7, -1 }, 
{ PB_15, (uint32_t) SAI1, SAI1_D3, 3 }, 
{ PB_15, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_15, (uint32_t) TIM1, TIM1_CH3N, 1 }, 
{ PB_15, (uint32_t) TIM15, TIM15_CH2, 14 }, 
{ PB_15, (uint32_t) TSC, TSC_G1_IO4, 9 }, 
{ PB_15, (uint32_t) LPTIM2, LPTIM2_IN2, 2 }, 
{ PD_8, (uint32_t) USART3, USART3_TX, 7 }, 
{ PD_8, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_9, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_9, (uint32_t) USART3, USART3_RX, 7 }, 
{ PD_9, (uint32_t) LPTIM3, LPTIM3_IN1, 14 }, 
{ PD_9, (uint32_t) LPTIM2, LPTIM2_IN2, 2 }, 
{ PD_10, (uint32_t) TSC, TSC_G6_IO1, 9 }, 
{ PD_10, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_10, (uint32_t) LPTIM2, LPTIM2_CH2, 2 }, 
{ PD_10, (uint32_t) USART3, USART3_CK, 7 }, 
{ PD_10, (uint32_t) LPTIM3, LPTIM3_ETR, 14 }, 
{ PD_11, (uint32_t) USART3, USART3_CTS, 7 }, 
{ PD_11, (uint32_t) LPTIM2, LPTIM2_ETR, 14 }, 
{ PD_11, (uint32_t) I2C3, I2C3_SMBA, 4 }, 
{ PD_11, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_11, (uint32_t) TSC, TSC_G6_IO2, 9 }, 
{ PD_11, (uint32_t) ADC2, ADC2_IN11, ADC_CHANNEL_11}, 
{ PD_11, (uint32_t) USART3, USART3_NSS, 7 }, 
{ PD_12, (uint32_t) TSC, TSC_G6_IO3, 9 }, 
{ PD_12, (uint32_t) I2C3, I2C3_SCL, 4 }, 
{ PD_12, (uint32_t) I3C1, I3C1_SCL, 3 }, 
{ PD_12, (uint32_t) LPTIM2, LPTIM2_IN1, 14 }, 
{ PD_12, (uint32_t) TIM4, TIM4_CH1, 2 }, 
{ PD_12, (uint32_t) USART3, USART3_RTS, 7 }, 
{ PD_12, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_12, (uint32_t) USART3, USART3_DE, 7 }, 
{ PD_12, (uint32_t) ADC2, ADC2_IN12, ADC_CHANNEL_12}, 
{ PD_13, (uint32_t) TIM4, TIM4_CH2, 2 }, 
{ PD_13, (uint32_t) TSC, TSC_G6_IO4, 9 }, 
{ PD_13, (uint32_t) LPTIM4, LPTIM4_IN1, 13 }, 
{ PD_13, (uint32_t) LPTIM2, LPTIM2_CH1, 14 }, 
{ PD_13, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_13, (uint32_t) ADC2, ADC2_IN13, ADC_CHANNEL_13}, 
{ PD_13, (uint32_t) I3C1, I3C1_SDA, 3 }, 
{ PD_13, (uint32_t) I2C3, I2C3_SDA, 4 }, 
{ PD_14, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_14, (uint32_t) LPTIM3, LPTIM3_CH1, 14 }, 
{ PD_14, (uint32_t) TIM4, TIM4_CH3, 2 }, 
{ PD_15, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_15, (uint32_t) LPTIM3, LPTIM3_CH2, 14 }, 
{ PD_15, (uint32_t) TIM4, TIM4_CH4, 2 }, 
{ PC_6, (uint32_t) TIM3, TIM3_CH1, 2 }, 
{ PC_6, (uint32_t) PWR, PWR_CSLEEP, 0 }, 
{ PC_6, (uint32_t) TSC, TSC_G4_IO1, 9 }, 
{ PC_6, (uint32_t) SDMMC1, SDMMC1_D6, 12 }, 
{ PC_6, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_6, (uint32_t) OCTOSPI1, OCTOSPI1_IO3, 10 }, 
{ PC_6, (uint32_t) SDMMC1, SDMMC1_D0DIR, 8 }, 
{ PC_7, (uint32_t) TIM3, TIM3_CH2, 2 }, 
{ PC_7, (uint32_t) SDMMC1, SDMMC1_D123DIR, 8 }, 
{ PC_7, (uint32_t) SDMMC1, SDMMC1_D7, 12 }, 
{ PC_7, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_7, (uint32_t) LPTIM2, LPTIM2_CH2, 14 }, 
{ PC_7, (uint32_t) TSC, TSC_G4_IO2, 9 }, 
{ PC_8, (uint32_t) SDMMC1, SDMMC1_D0, 12 }, 
{ PC_8, (uint32_t) TIM3, TIM3_CH3, 2 }, 
{ PC_8, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_8, (uint32_t) PWR, PWR_CSTOP, 0 }, 
{ PC_8, (uint32_t) TSC, TSC_G4_IO3, 9 }, 
{ PC_8, (uint32_t) LPTIM3, LPTIM3_CH1, 14 }, 
{ PC_9, (uint32_t) SDMMC1, SDMMC1_D1, 12 }, 
{ PC_9, (uint32_t) TIM3, TIM3_CH4, 2 }, 
{ PC_9, (uint32_t) LPTIM3, LPTIM3_CH2, 14 }, 
{ PC_9, (uint32_t) 0, EVENTOUT, 15 }, 
//TODO { PC_9, (uint32_t) USB, USB_NOE, 10 }, 
{ PC_9, (uint32_t) 0, TRACED0, 0 }, 
{ PC_9, (uint32_t) TSC, TSC_G4_IO4, 9 }, 
{ PA_8, (uint32_t) LPTIM2, LPTIM2_CH1, 14 }, 
{ PA_8, (uint32_t) TIM1, TIM1_CH1, 1 }, 
{ PA_8, (uint32_t) 0, MCO, 0 }, 
//{ PA_8, (uint32_t) USB, USB_[SOF], 10 }, 
{ PA_8, (uint32_t) USART1, USART1_CK, 7 }, 
{ PA_8, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_8, (uint32_t) 0, TRACECLK, 12 }, 
{ PA_8, (uint32_t) 0, MCO2, 11 }, 
{ PA_8, (uint32_t) SAI1, SAI1_CK2, 3 }, 
{ PA_8, (uint32_t) SAI1, SAI1_SCK_A, 13 }, 
{ PA_8, (uint32_t) SPI1, SPI1_RDY, 5 }, 
{ PA_9, (uint32_t) TIM15, TIM15_BKIN, 14 }, 
{ PA_9, (uint32_t) SPI2, SPI2_SCK, 3 }, 
{ PA_9, (uint32_t) TIM1, TIM1_CH2, 1 }, 
{ PA_9, (uint32_t) 0, MCO, 0 }, 
{ PA_9, (uint32_t) USART1, USART1_TX, 7 }, 
{ PA_9, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_9, (uint32_t) SAI1, SAI1_FS_A, 13 }, 
{ PA_9, (uint32_t) LPUART1, LPUART1_TX, 8 }, 
{ PA_10, (uint32_t) 0, MCO2, 11 }, 
{ PA_10, (uint32_t) CRS, CRS_SYNC, 0 }, 
{ PA_10, (uint32_t) TIM17, TIM17_BKIN, 14 }, 
{ PA_10, (uint32_t) TIM1, TIM1_CH3, 1 }, 
{ PA_10, (uint32_t) SAI1, SAI1_D1, 3 }, 
{ PA_10, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_10, (uint32_t) SAI1, SAI1_SD_A, 13 }, 
{ PA_10, (uint32_t) LPUART1, LPUART1_RX, 8 }, 
{ PA_10, (uint32_t) USART1, USART1_RX, 7 }, 
{ PA_10, (uint32_t) LPTIM2, LPTIM2_IN2, 2 }, 
{ PA_11, (uint32_t) TIM1, TIM1_CH4, 1 }, 
{ PA_11, (uint32_t) SPI1, SPI1_MISO, 5 }, 
{ PA_11, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_11, (uint32_t) USART1, USART1_CTS, 7 }, 
//TODO { PA_11, (uint32_t) USB, USB_DM, -1 }, 
{ PA_11, (uint32_t) USART1, USART1_NSS, 7 }, 
{ PA_11, (uint32_t) FDCAN1, FDCAN1_RX, 9 }, 
{ PA_11, (uint32_t) TIM1, TIM1_BKIN2, 2 }, 
{ PA_12, (uint32_t) USART1, USART1_DE, 7 }, 
{ PA_12, (uint32_t) TIM1, TIM1_ETR, 1 }, 
{ PA_12, (uint32_t) FDCAN1, FDCAN1_TX, 9 }, 
//TODO { PA_12, (uint32_t) USB, USB_DP, -1 }, 
{ PA_12, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_12, (uint32_t) SPI1, SPI1_MOSI, 5 }, 
{ PA_12, (uint32_t) USART1, USART1_RTS, 7 }, 
{ PA_12, (uint32_t) TIM4, TIM4_ETR, 2 }, 
//TODO { PA_13, (uint32_t) IR, IR_OUT, 1 }, 
{ PA_13, (uint32_t) 0, SWDIO, 0 }, 
{ PA_13, (uint32_t) 0, JTMS, 0 }, 
{ PA_13, (uint32_t) SAI1, SAI1_SD_B, 13 }, 
{ PA_13, (uint32_t) 0, EVENTOUT, 15 }, 
//TODO { PA_13, (uint32_t) USB, USB_NOE, 10 }, 
{ PA_14, (uint32_t) I2C1, I2C1_SMBA, 4 }, 
{ PA_14, (uint32_t) 0, JTCK, 0 }, 
{ PA_14, (uint32_t) SAI1, SAI1_FS_B, 13 }, 
{ PA_14, (uint32_t) I2C2, I2C2_SMBA, 3 }, 
{ PA_14, (uint32_t) I2C3, I2C3_SMBA, 5 }, 
{ PA_14, (uint32_t) LPTIM1, LPTIM1_CH1, 1 }, 
{ PA_14, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_14, (uint32_t) 0, SWCLK, 0 }, 
//{ PA_14, (uint32_t) USB, USB_[SOF], 10 }, 
{ PA_15, (uint32_t) TIM2, TIM2_CH1, 1 }, 
{ PA_15, (uint32_t) TIM2, TIM2_ETR, 2 }, 
{ PA_15, (uint32_t) SPI1, SPI1_NSS, 5 }, 
{ PA_15, (uint32_t) USART3, USART3_RTS, 7 }, 
{ PA_15, (uint32_t) SPI3, SPI3_NSS, 6 }, 
{ PA_15, (uint32_t) TSC, TSC_G3_IO1, 9 }, 
{ PA_15, (uint32_t) USART3, USART3_DE, 7 }, 
{ PA_15, (uint32_t) 0, EVENTOUT, 15 }, 
{ PA_15, (uint32_t) UART4, UART4_RTS, 8 }, 
{ PA_15, (uint32_t) 0, JTDI, 0 }, 
{ PA_15, (uint32_t) SAI1, SAI1_D2, 3 }, 
{ PA_15, (uint32_t) UART4, UART4_DE, 8 }, 
{ PC_10, (uint32_t) SPI3, SPI3_SCK, 6 }, 
{ PC_10, (uint32_t) UART4, UART4_TX, 8 }, 
{ PC_10, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_10, (uint32_t) OCTOSPI1, OCTOSPI1_IO0, 10 }, 
{ PC_10, (uint32_t) SDMMC1, SDMMC1_D2, 12 }, 
{ PC_10, (uint32_t) 0, TRACED1, 0 }, 
{ PC_10, (uint32_t) ADF1, ADF1_CCK1, 3 }, 
{ PC_10, (uint32_t) USART3, USART3_TX, 7 }, 
{ PC_10, (uint32_t) TSC, TSC_G3_IO2, 9 }, 
{ PC_10, (uint32_t) LPTIM3, LPTIM3_ETR, 2 }, 
{ PC_11, (uint32_t) SPI3, SPI3_MISO, 6 }, 
{ PC_11, (uint32_t) OCTOSPI1, OCTOSPI1_NCS, 5 }, 
{ PC_11, (uint32_t) USART3, USART3_RX, 7 }, 
{ PC_11, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_11, (uint32_t) LPTIM3, LPTIM3_IN1, 2 }, 
{ PC_11, (uint32_t) SDMMC1, SDMMC1_D3, 12 }, 
{ PC_11, (uint32_t) UART4, UART4_RX, 8 }, 
{ PC_11, (uint32_t) ADF1, ADF1_SDI0, 3 }, 
{ PC_11, (uint32_t) TSC, TSC_G3_IO3, 9 }, 
{ PC_12, (uint32_t) UART5, UART5_TX, 8 }, 
{ PC_12, (uint32_t) OCTOSPI1, OCTOSPI1_IO1, 10 }, 
{ PC_12, (uint32_t) TSC, TSC_G3_IO4, 9 }, 
{ PC_12, (uint32_t) SDMMC1, SDMMC1_CK, 12 }, 
{ PC_12, (uint32_t) 0, EVENTOUT, 15 }, 
{ PC_12, (uint32_t) 0, TRACED3, 0 }, 
{ PC_12, (uint32_t) USART3, USART3_CK, 7 }, 
{ PC_12, (uint32_t) SPI3, SPI3_MOSI, 6 }, 
{ PD_0, (uint32_t) FDCAN1, FDCAN1_RX, 9 }, 
{ PD_0, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_0, (uint32_t) SPI2, SPI2_NSS, 5 }, 
{ PD_1, (uint32_t) SPI2, SPI2_SCK, 5 }, 
{ PD_1, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_1, (uint32_t) FDCAN1, FDCAN1_TX, 9 }, 
{ PD_2, (uint32_t) TSC, TSC_SYNC, 9 }, 
{ PD_2, (uint32_t) LPTIM4, LPTIM4_ETR, 13 }, 
{ PD_2, (uint32_t) UART5, UART5_RX, 8 }, 
{ PD_2, (uint32_t) 0, TRACED2, 0 }, 
{ PD_2, (uint32_t) USART3, USART3_RTS, 7 }, 
{ PD_2, (uint32_t) OCTOSPI1, OCTOSPI1_IO2, 10 }, 
{ PD_2, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_2, (uint32_t) USART3, USART3_DE, 7 }, 
{ PD_2, (uint32_t) SDMMC1, SDMMC1_CMD, 12 }, 
{ PD_2, (uint32_t) TIM3, TIM3_ETR, 2 }, 
{ PD_3, (uint32_t) SPI2, SPI2_SCK, 3 }, 
{ PD_3, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_3, (uint32_t) SPI2, SPI2_MISO, 5 }, 
{ PD_4, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_4, (uint32_t) SPI2, SPI2_MOSI, 5 }, 
{ PD_4, (uint32_t) OCTOSPI1, OCTOSPI1_IO4, 10 }, 
{ PD_5, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_5, (uint32_t) SPI2, SPI2_RDY, 5 }, 
{ PD_5, (uint32_t) OCTOSPI1, OCTOSPI1_IO5, 10 }, 
{ PD_6, (uint32_t) SAI1, SAI1_D1, 3 }, 
{ PD_6, (uint32_t) OCTOSPI1, OCTOSPI1_IO6, 10 }, 
{ PD_6, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_6, (uint32_t) SAI1, SAI1_SD_A, 13 }, 
{ PD_6, (uint32_t) SPI3, SPI3_MOSI, 5 }, 
{ PD_7, (uint32_t) 0, EVENTOUT, 15 }, 
{ PD_7, (uint32_t) LPTIM4, LPTIM4_OUT, 13 }, 
{ PD_7, (uint32_t) OCTOSPI1, OCTOSPI1_IO7, 10 }, 
{ PB_3, (uint32_t) COMP2, COMP2_INM2, -1 }, 
{ PB_3, (uint32_t) USART1, USART1_DE, 7 }, 
{ PB_3, (uint32_t) 0, TRACESWO, 0 }, 
{ PB_3, (uint32_t) CRS, CRS_SYNC, 10 }, 
{ PB_3, (uint32_t) SPI3, SPI3_SCK, 6 }, 
{ PB_3, (uint32_t) LPTIM1, LPTIM1_CH1, 2 }, 
{ PB_3, (uint32_t) ADF1, ADF1_CCK0, 3 }, 
{ PB_3, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_3, (uint32_t) USART1, USART1_RTS, 7 }, 
{ PB_3, (uint32_t) 0, JTDO, 0 }, 
{ PB_3, (uint32_t) I2C1, I2C1_SDA, 4 }, 
{ PB_3, (uint32_t) SPI1, SPI1_SCK, 5 }, 
{ PB_3, (uint32_t) SAI1, SAI1_SCK_B, 13 }, 
{ PB_3, (uint32_t) TIM2, TIM2_CH2, 1 }, 
{ PB_4, (uint32_t) 0, NJTRST, 0 }, 
{ PB_4, (uint32_t) SPI3, SPI3_MISO, 6 }, 
{ PB_4, (uint32_t) UART5, UART5_DE, 8 }, 
{ PB_4, (uint32_t) TIM3, TIM3_CH1, 2 }, 
{ PB_4, (uint32_t) TIM17, TIM17_BKIN, 14 }, 
{ PB_4, (uint32_t) UART5, UART5_RTS, 8 }, 
{ PB_4, (uint32_t) OCTOSPI1, OCTOSPI1_IO4, 10 }, 
{ PB_4, (uint32_t) COMP2, COMP2_INP1, -1 }, 
{ PB_4, (uint32_t) SPI1, SPI1_MISO, 5 }, 
{ PB_4, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_4, (uint32_t) USART1, USART1_CTS, 7 }, 
{ PB_4, (uint32_t) TSC, TSC_G2_IO1, 9 }, 
{ PB_4, (uint32_t) SAI1, SAI1_MCLK_B, 13 }, 
{ PB_4, (uint32_t) USART1, USART1_NSS, 7 }, 
{ PB_4, (uint32_t) I2C3, I2C3_SDA, 4 }, 
{ PB_4, (uint32_t) LPTIM1, LPTIM1_CH2, 1 }, 
{ PB_4, (uint32_t) ADF1, ADF1_SDI0, 3 }, 
{ PB_5, (uint32_t) I2C1, I2C1_SMBA, 4 }, 
{ PB_5, (uint32_t) 0, WKUP6, -1 }, 
{ PB_5, (uint32_t) TIM3, TIM3_CH2, 2 }, 
