stm32-hotspot/STM32U3-M2-Serial-Mem-EMS-Test-Code/Naquada/Baseline/STM32U3LQFP100_SMPS.c
{ PB_5, (uint32_t) TSC, TSC_G2_IO2, 9 }, 
{ PB_5, (uint32_t) TIM16, TIM16_BKIN, 14 }, 
{ PB_5, (uint32_t) SAI1, SAI1_SD_B, 13 }, 
{ PB_5, (uint32_t) OCTOSPI1, OCTOSPI1_NCLK, 3 }, 
{ PB_5, (uint32_t) USART1, USART1_CK, 7 }, 
{ PB_5, (uint32_t) SPI1, SPI1_MOSI, 5 }, 
{ PB_5, (uint32_t) SPI3, SPI3_MOSI, 6 }, 
{ PB_5, (uint32_t) COMP2, COMP2_OUT, 12 }, 
{ PB_5, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_5, (uint32_t) LPTIM1, LPTIM1_IN1, 1 }, 
{ PB_5, (uint32_t) UART5, UART5_CTS, 8 }, 
{ PB_6, (uint32_t) I3C1, I3C1_SCL, 5 }, 
{ PB_6, (uint32_t) TIM16, TIM16_CH1N, 14 }, 
{ PB_6, (uint32_t) TIM4, TIM4_CH1, 2 }, 
{ PB_6, (uint32_t) TSC, TSC_G2_IO3, 9 }, 
{ PB_6, (uint32_t) OCTOSPI1, OCTOSPI1_IO5, 10 }, 
{ PB_6, (uint32_t) SAI1, SAI1_FS_B, 13 }, 
{ PB_6, (uint32_t) 0, WKUP3, -1 }, 
{ PB_6, (uint32_t) USART1, USART1_TX, 7 }, 
{ PB_6, (uint32_t) COMP2, COMP2_INP2, -1 }, 
{ PB_6, (uint32_t) I2C1, I2C1_SCL, 4 }, 
{ PB_6, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_6, (uint32_t) LPTIM1, LPTIM1_ETR, 1 }, 
{ PB_6, (uint32_t) I3C2, I3C2_SCL, 6 }, 
{ PB_7, (uint32_t) UART4, UART4_CTS, 8 }, 
{ PB_7, (uint32_t) TIM17, TIM17_CH1N, 14 }, 
{ PB_7, (uint32_t) TSC, TSC_G2_IO4, 9 }, 
{ PB_7, (uint32_t) LPTIM1, LPTIM1_IN2, 1 }, 
{ PB_7, (uint32_t) TIM4, TIM4_CH2, 2 }, 
//TODO { PB_7, (uint32_t) PVD, PVD_IN, -1 }, 
{ PB_7, (uint32_t) OCTOSPI1, OCTOSPI1_IO6, 10 }, 
{ PB_7, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_7, (uint32_t) COMP2, COMP2_INM1, -1 }, 
{ PB_7, (uint32_t) USART1, USART1_RX, 7 }, 
{ PB_7, (uint32_t) I2C1, I2C1_SDA, 4 }, 
{ PB_7, (uint32_t) 0, WKUP4, -1 }, 
{ PH_3, (uint32_t) I3C2, I3C2_SDA, 6 }, 
{ PH_3, (uint32_t) I3C1, I3C1_SDA, 3 }, 
{ PH_3, (uint32_t) 0, EVENTOUT, 15 }, 
{ PH_3, (uint32_t) TIM4, TIM4_CH4, 2 }, 
{ PB_8, (uint32_t) TIM16, TIM16_CH1, 14 }, 
{ PB_8, (uint32_t) TIM4, TIM4_CH3, 2 }, 
{ PB_8, (uint32_t) SDMMC1, SDMMC1_CKIN, 8 }, 
{ PB_8, (uint32_t) 0, WKUP5, -1 }, 
{ PB_8, (uint32_t) I2C1, I2C1_SCL, 4 }, 
{ PB_8, (uint32_t) SAI1, SAI1_CK1, 3 }, 
{ PB_8, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_8, (uint32_t) SPI3, SPI3_RDY, 6 }, 
{ PB_8, (uint32_t) I3C2, I3C2_SCL, 5 }, 
{ PB_8, (uint32_t) SDMMC1, SDMMC1_D4, 12 }, 
{ PB_8, (uint32_t) FDCAN1, FDCAN1_RX, 9 }, 
{ PB_8, (uint32_t) SAI1, SAI1_MCLK_A, 13 }, 
//TODO { PB_9, (uint32_t) IR, IR_OUT, 1 }, 
{ PB_9, (uint32_t) SDMMC1, SDMMC1_D5, 12 }, 
{ PB_9, (uint32_t) FDCAN1, FDCAN1_TX, 9 }, 
{ PB_9, (uint32_t) I3C2, I3C2_SDA, 6 }, 
{ PB_9, (uint32_t) TIM17, TIM17_CH1, 14 }, 
{ PB_9, (uint32_t) SPI2, SPI2_NSS, 5 }, 
{ PB_9, (uint32_t) TIM4, TIM4_CH4, 2 }, 
{ PB_9, (uint32_t) SAI1, SAI1_FS_A, 13 }, 
{ PB_9, (uint32_t) 0, EVENTOUT, 15 }, 
{ PB_9, (uint32_t) SDMMC1, SDMMC1_CDIR, 8 }, 
{ PB_9, (uint32_t) I2C1, I2C1_SDA, 4 }, 
{ PB_9, (uint32_t) SAI1, SAI1_D2, 3 }, 
{ PE_0, (uint32_t) 0, EVENTOUT, 15 }, 
{ PE_0, (uint32_t) TIM16, TIM16_CH1, 14 }, 
{ PE_0, (uint32_t) TIM4, TIM4_ETR, 2 }, 
};
const uint32_t DS_PADsCount = countof(DS_PADs);
const GPIO_TypeDef* IO_GPIOx[] = {
GPIOA,
GPIOB,
GPIOC,
GPIOD,
GPIOE,
0,
0,
GPIOH,
0,
0,
0,
0,
0,
0,
};
const uint32_t RCC_GPIOx_ClockEnBitMask[] = {
RCC_AHB2ENR1_GPIOAEN,//RCC_AHB2ENR_GPIOAEN,
RCC_AHB2ENR1_GPIOBEN,//RCC_AHB2ENR_GPIOBEN,
RCC_AHB2ENR1_GPIOCEN,//RCC_AHB2ENR_GPIOCEN,
RCC_AHB2ENR1_GPIODEN,//RCC_AHB2ENR_GPIODEN,
RCC_AHB2ENR1_GPIOEEN,//RCC_AHB2ENR_GPIOEEN,
0,
0,
RCC_AHB2ENR1_GPIOHEN,//RCC_AHB2ENR_GPIOHEN,
0,
0,
0,
0,
0,
0,
};
const uint16_t pGPIO_PadValidMask[] = {
0xffff,
0xefff,
0xffcf,
0xffff,
0xfffd,
0x0,
0x0,
0xb,
0x0,
0x0,
0x0,
0x0,
0x0,
0x0,
};

